/*******************************************************************************
函数名称：Delay1ms
函数功能：精确的延时  1ms
输入：无
输出：无
说明：该函数是在12M晶振下，12分频的单片机的延时
*******************************************************************************/

void Lcd1602_Delay1ms(uint c)   //Îó²î 0us
{
	uchar a,b;
	for (; c>0; c--)
	{
		 for (b=199;b>0;b--)
		 {
		  	for(a=1;a>0;a--);
		 }      
	} 	
}
/*******************************************************************************
函数名称：Delay10ms
函数功能：精确的延时  10ms
输入：无
输出：无
说明：该函数是在12M晶振下，12分频的单片机的延时
*******************************************************************************/
void Delay10ms(void)   //0us的误差
{
    unsigned char a,b,c;
    for(c=1;c>0;c--)
        for(b=38;b>0;b--)
            for(a=130;a>0;a--);
}
/*******************************************************************************
函数名称：Int0Configuration()
函数功能：初始化外部中断0   中断引脚P3.2      中断号为0
输入：无
输出：无
*******************************************************************************/

void Int0Configuration()
{
	//配置INT0
	IT0=1;  //设置中断触发方式为下降沿触发，      若为0则是低电平触发
	EX0=1;  //打开INT0的中断允许位
	EA=1;   //打开总中断Ï	
}
